{
  "news": [
    {
      "id": "7",
      "title": "Stakeholder's Forum against Forced Labor in Cocoa Industry",
      "day": "November 7, 2023",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705788707/IMG-20231107-WA0003_jgouuh.jpg",
      "content": "On Tuesday, November 7, 2023, the African Law Foundation (AFRILAW), in collaboration with various governmental and non-governmental entities including Sojitade Foundation, hosted a State Stakeholder's Forum at Imperial Hotels & Resorts in Akure, Ondo State. This forum focused on the Campaign against Forced and Child Labor in the Cocoa Industry in Nigeria. Commencing with an opening prayer and the National Anthem, the forum featured welcome remarks by AFRILAW, outlining the Campaign Program's goals, including raising awareness, disseminating research findings, and sparking conversations on forced labor in cocoa-producing states. Representatives from the National Human Rights Commission, Federal Ministry of Labor and Employment, and Cocoa Farmers Association of Nigeria also shared insights, emphasizing the infringement of human rights, causes, and consequences of forced labor. The event included a thorough review of research findings, revealing indicators like child labor, excessive overtime, intimidation, and more. AFRILAW recommended rigorous investigation and prosecution of forced labor cases, aggressive public sensitization, and adequate support for victims, and government intervention. During the general discussion, strategies to eliminate forced labor and improve working conditions emerged, including aggressive sensitization, advocacy visits to law enforcement agencies, media campaigns, and holding stakeholders accountable. The forum concluded with a closing session, group photographs, a vote of thanks, a closing prayer, and a shared lunch, marking a collective effort towards eradicating forced and child labor in the cocoa industry.",
      "category": "Good Health and Well-Being SDG3"
    },
    {
      "id": "1",
      "title": "Transformative Mental Health Awareness Walk on World Mental Health Day 2023",
      "day": "October 12, 2023",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488035/IMG_20231010_132620_-_1_jywz5y.png",
      "content": "On October 12, 2023, Sojitade Foundation took a pioneering stance in observance of World Mental Health Day 2023 by partnering with YALI Ondo Network, Red Cross Ondo Chapter, and Kids and Teens NGO to confront the prevalent mental health challenges faced by millions of Nigerians. The collaborative initiative orchestrated a 7 hours Mental Health Awareness Walk. This transformative journey was marked by participants carrying insightful placards, fostering open conversations, and dispelling the stigma surrounding mental health.The event's key objectives focused on educational empowerment, community sensitization, and stigma reduction. Participants engaged onlookers, initiating dialogues that demystified mental health issues. A creative blend of solemnity and liveliness characterized the walk, with musical bands accompanying the procession to create an engaging atmosphere. Informational and educational materials were distributed, providing valuable resources and contact information. This initiative underscores Sojitade Foundation's commitment to mental health advocacy, with future endeavors slated to include sustained educational programs, workshops, and community outreach initiatives. The Mental Health Awareness Walk stands as a pivotal step towards fostering a mentally healthy and supportive society, leaving an enduring impact on the ongoing efforts to address mental health challenges in Nigeria.",
      "category": "Good Health and Well-Being SDG3"
    },
    {
      "id": "2",
      "title": "Sojitade Foundation's Transformative Education Initiative at St. Stephen Primary School",
      "day": "August 3, 2023",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488055/SIIC_ajtpho.jpg",
      "content": "At the heart of Sojitade Foundation's commitment to breaking the cycle of poverty is the belief in the transformative power of education. In collaboration with various Civil Society Organizations, Sojitade Foundation embarked on a mission to extend quality education to children in rural areas, starting with the pupils of St. Stephen Primary School. The initiative, conducted in Iwoye community, unfolded with a warm reception from the pupils and a collaborative effort to set up banners and thoughtful gift displays. The program, commencing with an opening prayer and welcome speeches, featured motivational and sensitization speeches from our Executive Director Mrs. Temitope Aladejana, emphasizing the profound importance of education as the key to unlocking a world of knowledge and possibilities. Following the impactful address, we continued to inspire the young minds, instilling the belief that greatness is within their reach. The day took a delightful turn with a Riddles, Games and some Fun Sessions. Blending education with entertainment, this segment not only added excitement but also served as a playful avenue for intellectual stimulation. The session infused messages of teamwork, cooperation, and the importance of curiosity, creating a vibrant and supportive atmosphere. The event culminated in the distribution of educational tools, including school uniforms, bags, textbooks, and various stationery items, leaving an indelible mark on the young minds and igniting a passion for knowledge.",
      "category": "Quality Education SDG4"
    },
    {
      "id": "6",
      "title": "Empowering girls: International Day of Girl Child",
      "day": "October 11, 2022",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488025/EGCI_skcjjl.jpg",
      "content": "In celebration of the International Day of the Girl Child, Sojitade Foundation orchestrated a profound collaboration with Rotary Ondo chapter and various esteemed Civil Society Organizations at the esteemed St. Louis Secondary School in Ondo town. \nThis landmark event was not just an assembly; it was a dynamic platform for empowerment, enlightenment, and fostering a sense of agency among the attendees. A staggering total of 213 girls, representing the promise of tomorrow, were immersed in a day filled with transformative sessions. \nThe core focus of this initiative was to arm these young minds with knowledge crucial to their physical and mental well-being. In a society often fraught with taboos around menstruation, these girls were given a safe space to learn about menstrual health hygiene. \nThe sessions extended beyond the biological aspects, delving into the psychological and emotional dimensions of this natural process. Sex education, with a strong emphasis on abstinence, was a pivotal component, aiming not just to provide information but to empower the girls to make informed choices about their bodies. One of the highlights of the day was a hands-on practical session where the girls were skilfully guided in crafting reusable sanitary towels. \nThis not only addressed a critical need for affordable and sustainable menstrual hygiene products but also instilled a sense of resourcefulness and self-reliance among the participants. Each girl left not just with knowledge but also with a tangible tool that could positively impact her life. To further support the girls on their journey, carefully curated gift packs were distributed, containing not only menstrual hygiene products but also essential toiletries. \nThe symbolism of these packs went beyond the tangible items; it represented care, understanding, and a community that stands with them. As we reflect on the success of this initiative, we recognize that it is not a one-time event but a step in an ongoing journey. \nSojitade Foundation remains committed to sustaining and expanding such initiatives, reaching more schools, and touching the lives of countless girls who deserve the opportunity to grow, learn, and thrive. Through collaborative efforts and a shared commitment to empowering the girl child, we believe in creating a future where every girl can realize her full potential.",
      "category": "Gender Equality and Women and Girls Empowerment SDG5"
    },
    {
      "id": "3",
      "title": "Empowering Entrepreneurs: Insights and Skills for Thriving in Todays World",
      "day": "2021, July 14",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488031/IMG_20200224_114032_z76hla.jpg",
      "content": "In celebration of World Youth Skills Day, Sojitade Foundation and Kids & Teens Resource Centre joined forces to host an empowering event, themed 'Adapt & Thrive: Entrepreneurial Resilience Strategies in A Challenging Environment.' \nThe collaboration aimed to bring aspiring entrepreneurs and business enthusiasts together for a day of insightful discussions and training. The program featured an introduction session where participants shared their experiences as entrepreneurs, fostering interactions and networking. \nLecture Highlights: \n1.Strategies for Entrepreneurial Resilience: Mr. Oluwaseyi PalmDavid discussed the importance of determination and persistence in overcoming setbacks. He provided practical tips for dealing with business challenges, emphasizing resilience, and the entrepreneurial mindset. \n2.Social Media for Business Boost: Mrs. Patrick Adedoyin Adebisi, a social media marketing expert, shared insights on leveraging social media platforms for brand awareness, lead generation, and sales. Her emphasis on content quality and platform suitability resonated with attendees.\n3.Building Resilience Skills: Mr. Omolayo Owoleye focused on stress management, health prioritization, and the power of associations. His advice on avoiding credit sales, caution with loans, and faith in entrepreneurial journeys added depth to the discussion. Success and Impact: The program, attended by 32 participants, left a positive impact. \nThe participants expressed gratitude for gaining insights into entrepreneurial resilience strategies, with 8 males, 21 females, and 3 teenagers benefiting from the event. \nHome Essentials Training: A special session on liquid soap making, facilitated by Miss Oluwabukola, added a practical dimension. Participants learned the process, safety precautions, and the economic and sustainable benefits of making liquid soap at home. Each participant left with a bottle of their creation, a tangible symbol of empowerment.The event was a resounding success, equipping attendees with valuable knowledge, strategies, and skills to navigate the challenging entrepreneurial landscape.",
      "category": "End Poverty SDG1"
    },
    {
      "id": "4",
      "title": "Empowering Young Girls: Sojitade Foundation's Impactful Girl and Puberty Seminar",
      "day": "September 30, 2019",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705788457/Girls_and_Puberty_banner_xuoomd.jpg",
      "content": "Sojitade Foundation, in collaboration with Anglican Grammar School, Ijare, Akure, Ondo State, organized a transformative Girl and Puberty seminar on September 30, 2019. This initiative aimed to empower young girls aged 9-15 by providing comprehensive education on puberty, physical and emotional changes, proper hygiene, and embracing this natural transition. \nThe seminar successfully educated the girls about puberty, its signs and stages, and eliminated the stigma associated with menstruation, emphasizing its normality and importance for overall well-being. Structured to be engaging and informative, the seminar covered various activities from an expository presentation on puberty to practical guidance on using sanitary pads effectively. \nSpecial emphasis was given to menstruation education, personal hygiene, and discussions on sex education to encourage abstinence. Mrs. Temitope Aladejana, Sojitade Foundation's project manager, led the distribution of sanitary pads to support the girls, totaling 204 participants. The initiative concluded with expressions of gratitude from school representatives, highlighting the success of the educational session. Sojitade Foundation remains committed to uplifting and educating the younger generation, fostering a future where every girl can confidently embrace her femininity, achieve her dreams, and contribute positively to society",
      "category": "Gender Equality and Women and Girls Empowerment SDG5"
    },
    {
      "title": "Enchanting Christmas Celebration at Owode Community",
      "day": "2023-12-20",
      "img": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705787892/IMG_9775_wsy3ei.jpg",
      "content": "Sojitade Foundation joyfully hosted the Children's Christmas Party in Owode Community on December 20, 2023, creating a magical day filled with love and merriment. The festivities began with the registration of children at 10 am, leading into a heartwarming opening ceremony at 11 am. \nMrs. Temitope Aladejana, the Executive Director of Sojitade Foundation, welcomed the attendees, providing a brief on the purpose of the gathering and setting the tone for a day of festive fun. Distinguished guests, including the Queen of Owode and the Eyelobinrin of Owode, graced the occasion. The King of Owode acknowledged the organizers' efforts, encouraging them to continue their impactful work.\nThe event unfolded with interactive activities, including Christmas carol singing, games, and educational sessions. Special highlights featured a surprise visit from Mickey Mouse, spreading joy and laughter among the children. The day concluded with closing remarks, a heartfelt vote of thanks, and the distribution of gift parcels containing essential items to the children and esteemed guests. The success of the 2023 Christmas Party was evident in the smiles and gratitude expressed by the 124 attendees, a testament to Sojitade Foundation's commitment to bringing joy to the hearts of the Owode Community.",
      "id": "1464",
      "category": "End Poverty SDG1"
    }
  ],
  "events": [
    {
      "id": "4",
      "title": "Enchanting Christmas Celebration at Owode Community",
      "brief": "Sojitade Foundation joyfully hosted the Children's Christmas Party in Owode Community on December 20, 2023, creating a magical day filled with love and merriment. The festivities began with the registration of children at 10 am, leading into a heartwarming opening ceremony at 11 am.",
      "day": "2023-12-20",
      "category": "End Poverty SDG1"
    },
    {
      "id": "6",
      "title": "Stakeholder's Forum against Forced Labor in Cocoa Industry",
      "brief": "On Tuesday, November 7, 2023, the African Law Foundation (AFRILAW), in collaboration with various governmental and non-governmental entities including Sojitade Foundation, hosted a State Stakeholder's Forum at Imperial Hotels & Resorts in Akure, Ondo State. This forum focused on the Campaign against Forced and Child Labor in the Cocoa Industry in Nigeria.",
      "day": "2023-11-07",
      "category": "Good Health and Well-Being SDG3"
    },
    {
      "id": "9",
      "title": "Transformative Mental Health Awareness Walk on World Mental Health Day 2023",
      "brief": "On October 12, 2023, Sojitade Foundation took a pioneering stance in observance of World Mental Health Day 2023 by partnering with YALI Ondo Network, Red Cross Ondo Chapter, and Kids and Teens NGO to confront the prevalent mental health challenges faced by millions of Nigerians. The collaborative initiative orchestrated a 7 hours Mental Health Awareness Walk. This transformative journey was marked by participants carrying insightful placards, fostering open conversations, and dispelling the stigma surrounding mental health.",
      "day": "2023-10-12",
      "category": "Good Health and Well-Being SDG3"
    },
    {
      "id": "10",
      "title": "Sojitade Foundation's Transformative Education Initiative at St. Stephen Primary School",
      "brief": "In collaboration with various Civil Society Organizations, Sojitade Foundation embarked on a mission to extend quality education to children in rural areas, starting with the pupils of St. Stephen Primary School. The initiative, conducted in Iwoye community, unfolded with a warm reception from the pupils and a collaborative effort to set up banners and thoughtful gift displays.",
      "day": "2023-08-03",
      "category": "Quality Education SDG4"
    },
    {
      "id": "11",
      "title": "Empowering girls: International Day of Girl Child",
      "brief": "In celebration of the International Day of the Girl Child, Sojitade Foundation orchestrated a profound collaboration with Rotary Ondo chapter and various esteemed Civil Society Organizations at the esteemed St. Louis Secondary School in Ondo town. This landmark event was not just an assembly; it was a dynamic platform for empowerment, enlightenment, and fostering a sense of agency among the attendees. A staggering total of 213 girls, representing the promise of tomorrow, were immersed in a day filled with transformative sessions.",
      "day": "2022-10-11",
      "category": "Gender Equality and Women and Girls Empowerment SDG5"
    },
    {
      "id": "12",
      "title": "Empowering Entrepreneurs: Insights and Skills for Thriving in Todays World",
      "brief": "In celebration of World Youth Skills Day, Sojitade Foundation and Kids & Teens Resource Centre joined forces to host an empowering event, themed 'Adapt & Thrive: Entrepreneurial Resilience Strategies in A Challenging Environment.",
      "day": "2021-07-14",
      "category": "End Poverty SDG1"
    },
    {
      "id": "13",
      "title": "Empowering Young Girls: Sojitade Foundation's Impactful Girl and Puberty Seminar",
      "brief": "Sojitade Foundation, in collaboration with Anglican Grammar School, Ijare, Akure, Ondo State, organized a transformative Girl and Puberty seminar on September 30, 2019. This initiative aimed to empower young girls aged 9-15 by providing comprehensive education on puberty, physical and emotional changes, proper hygiene, and embracing this natural transition.",
      "day": "2019-09-30",
      "category": "Gender Equality and Women and Girls Empowerment SDG5"
    }
  ],
  "gallery": [
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936431/IMG_9527_1_lj4dx7.jpg",
      "id": "6.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705944717/IMG_20221011_150923_znfcdk.jpg",
      "id": "6.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705944704/IMG_20221011_164824_sgkp5s.jpg",
      "id": "6.3"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705944715/IMG_20221011_151111_vf8btk.jpg",
      "id": "6.4"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705788707/WhatsApp_Image_2023-06-30_at_11.41.11_AM_pfa2aw.jpg",
      "id": "4.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705788457/WhatsApp_Image_2023-06-30_at_11.41.11_AM_1_y0pmwk.jpg",
      "id": "4.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488007/20210525_115630_dusrq1.jpg",
      "id": "3.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705939131/20210615_111448_vnzovf.jpg",
      "id": "3.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705939128/IMG_20210614_102325_xas8r6.jpg",
      "id": "3.3"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705939123/20210615_111645_jxxwpu.jpg",
      "id": "3.4"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936319/IMG_6442_hczmmb.jpg",
      "id": "2.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936428/IMG_6362_hkd3ao.jpg",
      "id": "2.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936425/IMG_6441_vhgghj.jpg",
      "id": "2.3"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488053/WMHD_rochbn.jpg",
      "id": "1.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705488035/IMG_20231010_132620_-_1_jywz5y.png",
      "id": "1.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705937986/IMG_20231010_114407_ptityb.jpg",
      "id": "1.3"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936431/IMG_9527_1_lj4dx7.jpg",
      "id": "1.4"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936443/IMG-20231107-WA0015_opjeag.jpg",
      "id": "7.1"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936421/IMG_20231107_122008_naisza.jpg",
      "id": "7.2"
    },
    {
      "original": "https://res.cloudinary.com/dsrwlkso8/image/upload/v1705936332/IMG-20231107-WA0003_m9z1i2.jpg",
      "id": "7.3"
    }
  ],
  "account": [
    {
      "id": 10,
      "name": "Admin",
      "email": "info@sojitadefoundation.com",
      "password": "SojiTadeAdmin"
    }
  ]
}